export const personalityColors = {
    ENFJ: "#49a67f",  // 温暖的橙粉色，展现热情与关怀
    ENFP: "#47765f",  // 柔和的阳光黄色，充满活力与创造力
    ENTJ: "#6d4f5e",  // 鲜明的玫瑰红，代表果断与领导力
    ENTP: "#4e3141",  // 清新的薄荷绿，充满机智与探索精神
    ESFJ: "#579db6",  // 珊瑚粉橘色，展现温暖与真诚
    ESFP: "#987926",  // 奶油橙色，活泼开朗，富有能量
    ESTJ: "#3a7477",  // 清爽的天蓝色，象征可靠与组织力
    ESTP: "#b7912f",  // 淡淡的冰蓝色，表现大胆与行动力
    INFJ: "#a1c176",  // 梦幻的淡紫色，深思熟虑与神秘感
    INFP: "#6bad8c",  // 柔和的森林绿，理想主义与平和
    INTJ: "#6d4f5e",  // 高级的紫蓝色，代表战略性与智慧
    INTP: "#8e647a",  // 天空蓝，展现理性与好奇心
    ISFJ: "#87c8cb",  // 柔美的奶茶色，温柔与保护感
    ISFP: "#d4b21c",  // 温暖的薄荷绿，艺术性与自由随和
    ISTJ: "#8f8f8f",  // 柔和的浅灰色，稳重与传统
    ISTP: "#e0c024",  // 淡青色，独立与实用
};

